Revit 2026 API

# ComponentRepeaterIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ComponentRepeaterSlot Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As ComponentRepeaterSlot
	Get
```
```cpp
public:
virtual property ComponentRepeaterSlot^ Current {
	ComponentRepeaterSlot^ get ();
}
```
```fsharp
abstract Current : ComponentRepeaterSlot with get
override Current : ComponentRepeaterSlot with get
```

#### Property Value

ComponentRepeaterSlot

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ComponentRepeaterIterator Class

Autodesk.Revit.DB Namespace